9/data/attachments/2ae522f4aa852888.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9f294a72-b022-490e-aa65-2f2eab2308cd</nif:username>
            <nif:friendToBeAdded>Candice_ago_Friend_6221_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>